Create a table students with columns:

id (INT, primary key)

name (VARCHAR(50))

marks (INT)

class (VARCHAR(10))

Add a new column grade (VARCHAR(2)).

Rename column class → section.

Delete the grade column.

Drop the students table completely.

In [2]:
%load_ext sql
%sql mysql+pymysql://root:root@localhost/first

In [2]:
%%sql 

CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));

 * mysql+pymysql://root:***@localhost/first
(pymysql.err.OperationalError) (1050, "Table 'students' already exists")
[SQL: CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
desc students; 
ALTER TABLE students ADD grade VARCHAR(2);

In [ ]:
%%sql
ALTER TABLE students
RENAME COLUMN class TO section;

In [6]:
%%sql
CREATE TABLE faculty (name VARCHAR(20));
RENAME TABLE teachers to faculty;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
(pymysql.err.OperationalError) (1050, "Table 'faculty' already exists")
[SQL: RENAME TABLE teachers to faculty;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%%sql
DROP TABLE faculty;
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
3 rows affected.

[('employee',), ('employees',), ('students',)]

In [26]:

%%sql
INSERT INTO students (id, name, marks, section)
VALUES
(1, 'Aarav', 95, 'A'),
(2, 'Meera', 88, 'A'),
(3, 'Rohan', 76, 'B'),
(4, 'Priya', 64, 'B'),
(5, 'Karan', 82, 'C'),
(6, 'Isha', 91, 'C'),
(7, 'Vikram', 59, 'A'),
(8, 'Ananya', 85, 'B'),
(9, 'Sahil', 73, 'C'),
(10, 'Neha', 98, 'A');

 * mysql+pymysql://root:***@localhost/first
10 rows affected.

[]

Create a temporary table temp_high_marks that stores students with marks > 80.

Query the temporary table to show only name and marks.

Add a new student to the temporary table.

Drop the temporary table manually.

In [34]:
%%sql
CREATE TEMPORARY TABLE high_marks AS
SELECT name,section,marks
FROM students
WHERE marks>90;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[]

In [35]:
%%sql

SELECT * FROM  high_marks;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]

In [37]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('employee',), ('employees',), ('students',)]

| Can you do operations before WITH? | No |
| Must it end with a query using it? | Yes |
| Can the last query be only SELECT? | No, it can also be INSERT, UPDATE, DELETE |

In [42]:
%%sql
WITH high_scores AS(
SELECT * FROM high_marks
WHERE marks>=75)
SELECT * FROM high_scores;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]

In [44]:
%sql create database uber;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [46]:
%%sql
CREATE TABLE uber.rides(
    ride_id INT,
    driver_id INT,
    rider_id INT,
    pickup_location VARCHAR(100),
    drop_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10,2));

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [47]:
%%sql

INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, drop_location, ride_date, fare)
VALUES
(1, 101, 201, 'Koramangala', 'Indiranagar', '2025-11-10 09:30:00', 250.50),
(2, 102, 202, 'MG Road', 'Whitefield', '2025-11-10 10:15:00', 540.75),
(3, 103, 203, 'BTM Layout', 'Electronic City', '2025-11-10 11:00:00', 420.00),
(4, 104, 204, 'HSR Layout', 'Marathahalli', '2025-11-10 12:45:00', 310.25),
(5, 105, 205, 'Bellandur', 'Koramangala', '2025-11-10 14:10:00', 180.00);

 * mysql+pymysql://root:***@localhost/first
5 rows affected.

[]

## Primary key:
Ensures each record is unique and not NULL.
Each table can have only one primary key.

In [50]:
%%sql
CREATE TABLE student (
    student_id INT PRIMARY KEY,
    name VARCHAR(50)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## UNIQUE:
Ensures all values in a column are different (but allows one NULL).

In [53]:
%%sql
ALTER TABLE first.employees ADD COLUMN(
    email VARCHAR(100) UNIQUE
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [61]:
%%sql
ALTER TABLE uber.rides
ADD CONSTRAINT pk_driver UNIQUE (driver_id);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [63]:
%%sql
desc uber.rides; #not displayed as pk_driver for driver_id
SHOW INDEX FROM uber.rides; #To actually see the constraint name, use

 * mysql+pymysql://root:***@localhost/first
7 rows affected.
2 rows affected.

[('rides', 0, 'PRIMARY', 1, 'ride_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('rides', 0, 'pk_driver', 1, 'driver_id', 'A', 5, None, None, 'YES', 'BTREE', '', '', 'YES', None)]

## NOT NULL:
Ensures a column cannot have NULL values.

In [64]:
%%sql
CREATE TABLE users (
    username VARCHAR(50) NOT NULL
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## CHECK:
Ensures the values meet a specific condition.

In [66]:
%%sql
CREATE TABLE first.products (
    price DECIMAL(10,2) CHECK (price > 0)
);

 * mysql+pymysql://root:***@localhost/first
(pymysql.err.OperationalError) (1050, "Table 'products' already exists")
[SQL: CREATE TABLE first.products (
    price DECIMAL(10,2) CHECK (price > 0)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## DEFAULT:
Sets a default value when no value is given.

In [67]:
%%sql
CREATE TABLE accounts (
    balance DECIMAL(10,2) DEFAULT 0.00
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## AUTO_INCREMENT / SERIAL:
Automatically generates a unique value (mostly used for IDs).

In [68]:
%%sql
CREATE TABLE books (
    book_id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(100)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## *COMPOSITE KEY*
Combines multiple columns as a single primary key.

In [69]:
%%sql
CREATE TABLE attendance (
    student_id INT,
    date DATE,
    PRIMARY KEY (student_id, date)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [39]:
%%sql
DROP TABLE IF EXISTS employees,departments;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## Foreign Key
A foreign key is a column (or set of columns) in one table that creates a link to another table’s primary key.
It ensures the relationship between the two tables remains consistent.

(A foreign key in one table is a reference to the primary key in another.)

In [40]:
%%sql

CREATE TABLE departments (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(50)
);

CREATE TABLE employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    dept_id INT
    
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
0 rows affected.

[]


**INSERT**-You can only insert rows in the child table if the foreign key exists in the parent.

**UPDATE**-You can’t change or delete a parent key if child rows depend on it (unless you specify CASCADE rules).

**DELETE**-Deleting a parent row that has child references will cause an error unless cascading is enabled.

In [42]:
%%sql
ALTER TABLE employees
ADD CONSTRAINT fk_dept
FOREIGN KEY (dept_id)
REFERENCES departments(dept_id)
ON DELETE CASCADE
ON UPDATE CASCADE;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]


**CASCADE**	- Automatically deletes/updates child rows when parent changes.

**SET NULL** - Sets the foreign key column to NULL when parent is deleted.

**RESTRICT** - Prevents deleting parent if child rows exist (default).

**NO ACTION** - Same as RESTRICT (default in MySQL).

In [43]:
%%sql
INSERT INTO departments VALUES (1, 'HR'), (2, 'IT'), (3, 'Finance');

INSERT INTO employees VALUES
(101, 'Alice', 1),
(102, 'Bob', 2),
(103, 'Charlie', 2),
(104, 'David', 3);

 * mysql+pymysql://root:***@localhost/first
3 rows affected.
4 rows affected.

[]

In [44]:
%%sql

DELETE FROM departments WHERE dept_id = 2;
#all employees in that department are also deleted

 * mysql+pymysql://root:***@localhost/first
1 rows affected.
0 rows affected.

[]

In [47]:
%%sql

SHOW INDEX FROM departments;
SHOW INDEX FROM employees;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.
2 rows affected.

[('employees', 0, 'PRIMARY', 1, 'emp_id', 'A', 2, None, None, '', 'BTREE', '', '', 'YES', None),
 ('employees', 1, 'fk_dept', 1, 'dept_id', 'A', 2, None, None, 'YES', 'BTREE', '', '', 'YES', None)]

In [4]:
%%sql

CREATE TABLE customer(
    id INT PRIMARY KEY AUTO_INCREMENT,
    login_device VARCHAR(20),
    name VARCHAR(50),
    ip_add VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10,2),
    is_placed BOOLEAN DEFAULT FALSE,
    is_viewed BOOLEAN DEFAULT FALSE,
    transaction_status VARCHAR(20)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [6]:

%%sql

INSERT INTO customer (
    login_device, name, ip_add, product, amount, is_placed, is_viewed, transaction_status
) VALUES
('Mobile', 'Ravi', '192.168.1.10', 'Laptop', 55000.00, TRUE, FALSE, 'Completed'),
('Desktop', 'Priya', '192.168.1.11', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
('Tablet', 'Karan', '192.168.1.12', 'Headphones', 2500.00, FALSE, TRUE, 'Pending'),
('Mobile', 'Sneha', '192.168.1.13', 'Smartwatch', 9000.00, TRUE, TRUE, 'Completed'),
('Desktop', 'Ankit', '192.168.1.14', 'Monitor', 12000.00, FALSE, FALSE, 'Failed'),
('Laptop', 'Nisha', '192.168.1.15', 'Keyboard', 1500.00, TRUE, TRUE, 'Completed'),
('Mobile', 'Rajesh', '192.168.1.16', 'Mouse', 700.00, FALSE, TRUE, 'Viewed'),
('Tablet', 'Asha', '192.168.1.17', 'Speaker', 3000.00, TRUE, FALSE, 'Completed');

 * mysql+pymysql://root:***@localhost/first
8 rows affected.

[]

In [ ]:
%%sql

#logical operators-and,or,not
SELECT COUNT(*) FROM customer WHERE transaction_status='Failed' and product='Laptop';

SELECT COUNT(*) FROM customer WHERE transaction_status in ('Viewed','Failed','Pending');


SELECT COUNT(*) FROM customer WHERE transaction_status not in ('Viewed','Failed','Pending');


SELECT COUNT(*) AS Purchase_count FROM customer WHERE transaction_status not in ('Viewed','Failed','Pending');

 * mysql+pymysql://root:***@localhost/first
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[(5,)]

## Aggregation func

In [ ]:
%%sql
SELECT SUM(amount)AS total_amount FROM customer WHERE transaction_status='Completed';
SELECT MAX(amount)AS max_amount FROM customer WHERE transaction_status='Completed';
SELECT MIN(amount)AS min_amount FROM customer WHERE transaction_status='Completed';
#count,avg

 * mysql+pymysql://root:***@localhost/first
1 rows affected.
1 rows affected.
1 rows affected.

[(Decimal('1500.00'),)]

If your SELECT includes both aggregate and non-aggregate columns,
every non-aggregate column must appear in the GROUP BY clause

GROUP BY tells SQL how to split the table into mini-tables before applying aggregation.

In [21]:


%%sql

SELECT login_device,SUM(amount) AS total_sale 
FROM customer
GROUP BY login_device;

 * mysql+pymysql://root:***@localhost/first
4 rows affected.

[('Mobile', Decimal('64700.00')),
 ('Desktop', Decimal('32000.00')),
 ('Tablet', Decimal('5500.00')),
 ('Laptop', Decimal('1500.00'))]

HAVING is used to filter grouped (aggregate) results —
after the GROUP BY has been applied.


**WHERE** - Individual rows	- Filtering before grouping	-WHERE amount > 20000

**HAVING** - Groups (after GROUP BY)-Filtering after aggregation-HAVING SUM(amount) > 50000

In [24]:
%%sql
SELECT name, SUM(amount) AS total_spent
FROM customer
GROUP BY name
HAVING SUM(amount) > 50000;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[('Ravi', Decimal('55000.00'))]

Conditional Logic in SQL — The CASE Statement

CASE ... WHEN ... THEN ... ELSE ... END.

In [27]:
%%sql

SELECT name,amount,
    CASE
        WHEN amount>30000 THEN 'High value'
        WHEN amount BETWEEN 10000 AND 29999 THEN 'Medium value'
        ELSE 'Low value'
    END AS purchase_category
FROM customer;

 * mysql+pymysql://root:***@localhost/first
8 rows affected.

[('Ravi', Decimal('55000.00'), 'High value'),
 ('Priya', Decimal('20000.00'), 'Medium value'),
 ('Karan', Decimal('2500.00'), 'Low value'),
 ('Sneha', Decimal('9000.00'), 'Low value'),
 ('Ankit', Decimal('12000.00'), 'Medium value'),
 ('Nisha', Decimal('1500.00'), 'Low value'),
 ('Rajesh', Decimal('700.00'), 'Low value'),
 ('Asha', Decimal('3000.00'), 'Low value')]

In [31]:
%%sql
SELECT 
    name,
    IF(amount > 20000, 'High', 'Low') AS purchase_type
FROM Customer;

 * mysql+pymysql://root:***@localhost/first
8 rows affected.

[('Ravi', 'High'),
 ('Priya', 'Low'),
 ('Karan', 'Low'),
 ('Sneha', 'Low'),
 ('Ankit', 'Low'),
 ('Nisha', 'Low'),
 ('Rajesh', 'Low'),
 ('Asha', 'Low')]

In [36]:
%%sql
SELECT name,product,transaction_status,
    CASE 
        WHEN transaction_status = 'Completed' AND amount > 20000 THEN 'Successful & High Value'
        WHEN transaction_status = 'Completed' THEN 'Successful'
        ELSE 'Not Successful'
    END AS transaction_type
FROM Customer;

 * mysql+pymysql://root:***@localhost/first
8 rows affected.

[('Ravi', 'Laptop', 'Completed', 'Successful & High Value'),
 ('Priya', 'Smartphone', 'Completed', 'Successful'),
 ('Karan', 'Headphones', 'Pending', 'Not Successful'),
 ('Sneha', 'Smartwatch', 'Completed', 'Successful'),
 ('Ankit', 'Monitor', 'Failed', 'Not Successful'),
 ('Nisha', 'Keyboard', 'Completed', 'Successful'),
 ('Rajesh', 'Mouse', 'Viewed', 'Not Successful'),
 ('Asha', 'Speaker', 'Completed', 'Successful')]